doprause/microkit/lib/targets/stm32/common/i3c.c
#include "libs/microkit/lib/assert.h"
#include "libs/microkit/lib/core.h"
#include "libs/microkit/lib/debug.h"
#include "libs/microkit/lib/microkit.h"
#include "libs/microkit/lib/platform/drivers/i3c.h"
#include "libs/microkit/lib/utils/math.h"
#include "microkit/config/i3c.h"

#include "stm32h5xx_hal.h"

/* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
   👉 Constants
   - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
#define MICROKIT_CONFIG_I3C2_MAX_TARGET_DESCRIPTORS 4 // STM32H533RE support up to 4 targets

/* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
   👉 Types
   - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// typedef struct {
//    char* TARGET_NAME;           /*!< Marketing Target reference */
//    uint32_t TARGET_ID;          /*!< Target Identifier on the Bus */
//    uint64_t TARGET_BCR_DCR_PID; /*!< Concatenation value of PID, BCR and DCR of the target */
//    uint8_t STATIC_ADDR;         /*!< Static Address of the target, value found in the datasheet of the device */
//    uint8_t DYNAMIC_ADDR;        /*!< Dynamic Address of the target preset by software/application */
// } TargetDesc_TypeDef;

typedef enum {
   MKIT_I3C_BUS_STATE_RESET,
   MKIT_I3C_BUS_STATE_READY,
   MKIT_I3C_BUS_STATE_READING,
   MKIT_I3C_BUS_STATE_WRITING,
   MKIT_I3C_BUS_STATE_DYN_ADDR_ASSIGNMENT_RUNNING,
   MKIT_I3C_BUS_STATE_DYN_ADDR_ASSIGNMENT_FINISHED,
   MKIT_I3C_BUS_STATE_ERROR,
} I3cBusState;

// typedef struct {
//    bool isRepeatedStart;
//    bool memoryReadComplete;
//    bool memoryWriteComplete;
//    bool masterReceiveComplete;
//    bool masterTransmitComplete;
// } I2cStatus;

typedef struct {
   // I2cMasterMemoryReadCompleteHandler memoryReadCompleteHandler;
   // I2cMasterMemoryWriteCompleteHandler memoryWriteCompleteHandler;
   // I2cMasterReceiveCompleteHandler masterReceiveCompleteHandler;
   // I2cMasterTransmitCompleteHandler masterTransmitCompleteHandler;
   // I2cSlaveTransmissionStartedHandler slaveTransmissionStartedHandler;
   // I2cSlaveTransmissionStoppedHandler slaveTransmissionStoppedHandler;
   // I2cSlaveTransmissionErrorHandler slaveTransmissionErrorHandler;
   // I2cSlaveByteReceivedHandler slaveByteReceivedHandler;
   // I2cSlaveByteRequestedHandler slaveByteRequestedHandler;
} I3cCallbacks;

// typedef struct {
//    UInt8 rxByte;
//    UInt8 txByte;
// } I2cSlaveState;

// typedef I3cTargetDeviceConfiguration I3cTargetDeviceConfiguration;

/**
 * @brief I3C device.
 */
struct I3cDeviceObject {
   DriverState state;
   I3cBusState busState;
   I3cCallbacks callbacks;
   I3cTargetDescriptor targetDescriptors[MICROKIT_CONFIG_I3C2_MAX_TARGET_DESCRIPTORS];
   Size targetDescriptorsCount;
   // I3cTargetDeviceConfiguration targetConfigurations[MICROKIT_CONFIG_I3C2_MAX_TARGET_DESCRIPTORS];
   Size targetCount;
   //    I2cMode mode;
   //    I2cStatus status;
   //    I2cSlaveState slave;
   I3C_HandleTypeDef mcu;
};

/* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
   👉 Configuration
   - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// #if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I2C_USE_I2C1)
// struct I2cDeviceObject DEVICE_I2C1_INSTANCE = {
//     .busState = MKIT_I3C_BUS_STATE_RESET,
//     .state = MKIT_DRIVER_STATE_UNINITIALIZED,
//     .targetCount = 0,
//     .targetDescriptorsCount = 0,
//     .mcu = {0},
// };
// MicrokitI2cDevice DEVICE_I2C1 = &DEVICE_I2C1_INSTANCE;
// #endif // MICROKIT_CONFIG_I2C_USE_I2C1

#if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I3C_USE_I3C2)
struct I3cDeviceObject DEVICE_I3C2_INSTANCE = {
    .busState = MKIT_I3C_BUS_STATE_RESET,
    .state = MKIT_DRIVER_STATE_UNINITIALIZED,
    .targetCount = 0,
    .targetDescriptorsCount = 0,
    .mcu = {0},
};
MicrokitI3cDevice DEVICE_I3C2 = &DEVICE_I3C2_INSTANCE;
#endif // MICROKIT_CONFIG_I3C_USE_I3C2

// #if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I2C_USE_I2C3)
// struct I2cDeviceObject DEVICE_I2C3_INSTANCE = {
//     .busState = MKIT_I3C_BUS_STATE_RESET,
//     .state = MKIT_DRIVER_STATE_UNINITIALIZED,
//     .targetCount = 0,
//     .targetDescriptorsCount = 0,
//     .mcu = {0},
// };
// MicrokitI2cDevice DEVICE_I2C3 = &DEVICE_I2C3_INSTANCE;
// #endif // MICROKIT_CONFIG_I2C_USE_I2C3

/* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
   👉 Private functions
   - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// static inline void rearm_i2c_slave_mode(const MicrokitI2cDevice device) {

//    device->status.isRepeatedStart = false;

//    HAL_I2C_EnableListen_IT(&device->mcu);
// }

/* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
static inline MicrokitI3cDevice private_get_device_from_handle(I3C_HandleTypeDef* handle) {
#if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I3C_USE_I3C1)
   if (handle == &DEVICE_I3C1->mcu) {
      return DEVICE_I3C1;
   }
#endif
#if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I3C_USE_I3C2)
   if (handle == &DEVICE_I3C2->mcu) {
      return DEVICE_I3C2;
   }
#endif
#if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I3C_USE_I3C3)
   if (handle == &DEVICE_I3C3->mcu) {
      return DEVICE_I3C3;
   }
#endif

   ASSERT_NOT_REACHED;

   return 0;
}

/* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
void private_start_dynamic_address_assignment(MicrokitI3cDevice device) {

   device->busState = MKIT_I3C_BUS_STATE_DYN_ADDR_ASSIGNMENT_RUNNING;

   if (HAL_I3C_Ctrl_DynAddrAssign_IT(&device->mcu, I3C_ONLY_ENTDAA) != HAL_OK) {
      device->busState = MKIT_I3C_BUS_STATE_ERROR;
   }
}

/* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
   👉 Lifecycle functions
   - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
void microkit_i3c_init(void) {

#if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I3C_USE_I3C1)
   // TBD
#endif

#if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I3C_USE_I3C2)
#if MICROKIT_CONFIG_I3C2_MODE == MICROKIT_I3C_CONTROLLER_MODE
   DEVICE_I3C2->mcu.Instance = I3C2;
   DEVICE_I3C2->mcu.Mode = HAL_I3C_MODE_CONTROLLER;
   DEVICE_I3C2->mcu.Init.CtrlBusCharacteristic.SDAHoldTime = HAL_I3C_SDA_HOLD_TIME_0_5;
   DEVICE_I3C2->mcu.Init.CtrlBusCharacteristic.WaitTime = HAL_I3C_OWN_ACTIVITY_STATE_0;
   DEVICE_I3C2->mcu.Init.CtrlBusCharacteristic.SCLPPLowDuration = 0x27;
   DEVICE_I3C2->mcu.Init.CtrlBusCharacteristic.SCLI3CHighDuration = 0x27;
   DEVICE_I3C2->mcu.Init.CtrlBusCharacteristic.SCLODLowDuration = 0x27;
   DEVICE_I3C2->mcu.Init.CtrlBusCharacteristic.SCLI2CHighDuration = 0x00;
   DEVICE_I3C2->mcu.Init.CtrlBusCharacteristic.BusFreeDuration = 0x06;
   DEVICE_I3C2->mcu.Init.CtrlBusCharacteristic.BusIdleDuration = 0x1e;
#elif MICROKIT_CONFIG_I3C2_MODE == MICROKIT_I3C_TARGET_MODE
   DEVICE_I3C2->mcu.Instance = I3C2;
   DEVICE_I3C2->mcu.Mode = HAL_I3C_MODE_TARGET;
   DEVICE_I3C2->mcu.Init.TgtBusCharacteristic.BusAvailableDuration = 0x1e;
#endif // MICROKIT_CONFIG_I3C2_MODE == MICROKIT_I3C_TARGET_MODE
   DEVICE_I3C2->state = MKIT_DRIVER_STATE_STOPPED;
#endif // MICROKIT_CONFIG_I3C_USE_I3C2

#if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I3C_USE_I3C3)
   // TBD
#endif
}

