doprause/microkit/lib/targets/stm32/common/i3c.c
/* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
void microkit_i3c_start(const MicrokitI3cDevice device, I3cConfig config) {

   ASSERT_NOT_NULL_POINTER(device);

   bool ok = false;

#if MICROKIT_CONFIG_I3C2_MODE == MICROKIT_I3C_CONTROLLER_MODE
   ASSERT_NOT_NULL_POINTER(config.targetDescriptors);

   device->targetDescriptorsCount = min(config.targetDescriptorsCount, MICROKIT_CONFIG_I3C2_MAX_TARGET_DESCRIPTORS);
   for (Size i = 0; i < device->targetDescriptorsCount; i++) {
      device->targetDescriptors[i] = config.targetDescriptors[i];
   }

   ok = HAL_I3C_Init(&DEVICE_I3C2->mcu) == HAL_OK;
   ASSERT(ok);

   I3C_FifoConfTypeDef fifoConfig = {0};
   fifoConfig.RxFifoThreshold = HAL_I3C_RXFIFO_THRESHOLD_1_4;
   fifoConfig.TxFifoThreshold = HAL_I3C_TXFIFO_THRESHOLD_1_4;
   fifoConfig.ControlFifo = HAL_I3C_CONTROLFIFO_DISABLE;
   fifoConfig.StatusFifo = HAL_I3C_STATUSFIFO_DISABLE;

   ok = HAL_I3C_SetConfigFifo(&DEVICE_I3C2->mcu, &fifoConfig) == HAL_OK;
   ASSERT(ok);

   /** Configure controller
    */
   I3C_CtrlConfTypeDef controllerConfig = {0};
   controllerConfig.DynamicAddr = 0;
   controllerConfig.StallTime = 0x00;
   controllerConfig.HotJoinAllowed = DISABLE;
   controllerConfig.ACKStallState = DISABLE;
   controllerConfig.CCCStallState = DISABLE;
   controllerConfig.TxStallState = DISABLE;
   controllerConfig.RxStallState = DISABLE;
   controllerConfig.HighKeeperSDA = DISABLE;

   ok = HAL_I3C_Ctrl_Config(&DEVICE_I3C2->mcu, &controllerConfig) == HAL_OK;
   ASSERT(ok);

   private_start_dynamic_address_assignment(device);
#elif MICROKIT_CONFIG_I3C2_MODE == MICROKIT_I3C_TARGET_MODE
   ok = HAL_I3C_Init(&DEVICE_I3C2->mcu) == HAL_OK;
   ASSERT(ok);

   I3C_FifoConfTypeDef fifoConfig = {0};
   fifoConfig.RxFifoThreshold = HAL_I3C_RXFIFO_THRESHOLD_1_4;
   fifoConfig.TxFifoThreshold = HAL_I3C_TXFIFO_THRESHOLD_1_4;
   fifoConfig.ControlFifo = HAL_I3C_CONTROLFIFO_DISABLE;
   fifoConfig.StatusFifo = HAL_I3C_STATUSFIFO_DISABLE;

   ok = HAL_I3C_SetConfigFifo(&DEVICE_I3C2->mcu, &fifoConfig) == HAL_OK;
   ASSERT(ok);

   I3C_TgtConfTypeDef targetConfig = {0};
   targetConfig.Identifier = 0;
   targetConfig.MIPIIdentifier = 0;
   targetConfig.CtrlRoleRequest = DISABLE;
   targetConfig.HotJoinRequest = DISABLE;
   targetConfig.IBIRequest = DISABLE;
   targetConfig.IBIPayload = DISABLE;
   targetConfig.IBIPayloadSize = HAL_I3C_PAYLOAD_1_BYTE;
   targetConfig.MaxReadDataSize = 0;
   targetConfig.MaxWriteDataSize = 0;
   targetConfig.CtrlCapability = DISABLE;
   targetConfig.GroupAddrCapability = DISABLE;
   targetConfig.DataTurnAroundDuration = HAL_I3C_TURNAROUND_TIME_TSCO_LESS_12NS;
   targetConfig.MaxReadTurnAround = 0;
   targetConfig.MaxDataSpeed = HAL_I3C_GETMXDS_FORMAT_1;
   targetConfig.MaxSpeedLimitation = DISABLE;
   targetConfig.HandOffActivityState = HAL_I3C_HANDOFF_ACTIVITY_STATE_0;
   targetConfig.HandOffDelay = DISABLE;
   targetConfig.PendingReadMDB = DISABLE;

   ok = HAL_I3C_Tgt_Config(&DEVICE_I3C2->mcu, &targetConfig) == HAL_OK;
   ASSERT(ok);
#endif

   device->state = MKIT_DRIVER_STATE_RUNNING;
}

/* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
void microkit_i3c_stop(const MicrokitI3cDevice device) {

   ASSERT_NOT_NULL_POINTER(device);

   // TODO: Stop STM32 I3C peripheral

   device->state = MKIT_DRIVER_STATE_STOPPED;
}

/* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
void microkit_i3c_process(const MicrokitI3cDevice device) {

   if (HAL_I3C_GetState(&device->mcu) != HAL_I3C_STATE_READY) {
      // Wait until peripheral is ready again
   } else if (device->busState == MKIT_I3C_BUS_STATE_DYN_ADDR_ASSIGNMENT_FINISHED) {
      for (Size index = 0; index < device->targetCount; index++) {
         I3C_DeviceConfTypeDef deviceConfiguration = {0};

         deviceConfiguration.DeviceIndex = (index + 1);
         deviceConfiguration.TargetDynamicAddr = device->targetDescriptors[index].dynamicAddress;
         deviceConfiguration.IBIAck = __HAL_I3C_GET_IBI_CAPABLE(__HAL_I3C_GET_BCR(device->targetDescriptors[index].targetBcrDcrPid));
         deviceConfiguration.IBIPayload = __HAL_I3C_GET_IBI_PAYLOAD(__HAL_I3C_GET_BCR(device->targetDescriptors[index].targetBcrDcrPid));
         deviceConfiguration.CtrlRoleReqAck = __HAL_I3C_GET_CR_CAPABLE(__HAL_I3C_GET_BCR(device->targetDescriptors[index].targetBcrDcrPid));
         deviceConfiguration.CtrlStopTransfer = DISABLE;

         if (HAL_I3C_Ctrl_ConfigBusDevices(&device->mcu, &deviceConfiguration, 1U) != HAL_OK) {
            device->busState = MKIT_I3C_BUS_STATE_ERROR;
         }
      }

      device->busState = MKIT_I3C_BUS_STATE_READY;
   }
}

// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
//    👉 I2C master mode functions
//    - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// StatusOrNumber microkit_i2c_receive(
//     const MicrokitI2cDevice device, UInt8 deviceAddress,
//     UInt8* data, Size dataSize, Bool async) {

//    ASSERT_NOT_NULL_POINTER(device);
//    ASSERT(device->state == MKIT_DRIVER_STATE_RUNNING);

//    if (HAL_I2C_GetState(&device->mcu) != HAL_I2C_STATE_READY) {
//       return STATUS_ERROR;
//    }

//    if (device->status.masterReceiveComplete == false) {
//       return STATUS_ERROR;
//    }

//    HAL_Delay(10); // Without this delay, the transfer is not reliable

//    device->status.masterReceiveComplete = false;

//    HAL_StatusTypeDef status = HAL_I2C_Master_Receive_IT(
//        &device->mcu, deviceAddress << 1, data, dataSize);

//    // If we are not in async mode, we need to wait for the transfer to complete
//    if (!async) {
//       while (!device->status.masterReceiveComplete)
//          ;
//    }

//    return status == HAL_OK ? (int)dataSize : STATUS_ERROR;
// }

/* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
StatusOrNumber microkit_i3c_transmit(
    const MicrokitI3cDevice device, const UInt8 deviceAddress,
    UInt8* data, Size dataSize, Bool async) {

