doprause/microkit/lib/targets/stm32/common/i3c.c
   ASSERT_NOT_NULL_POINTER(device);
   ASSERT(device->state == MKIT_DRIVER_STATE_RUNNING);

   if (device->busState != MKIT_I3C_BUS_STATE_READY) {
      return STATUS_ERROR;
   }

   //    if (HAL_I2C_GetState(&device->mcu) != HAL_I2C_STATE_READY) {
   //       return STATUS_ERROR;
   //    }

   //    if (device->status.masterTransmitComplete == false) {
   //       return STATUS_ERROR;
   //    }

   HAL_Delay(10); // Without this delay, the transfer is not reliable

   //    device->status.masterTransmitComplete = false;

   UInt32 controlBuffer[1];

   I3C_PrivateTypeDef transferDescriptor =
       {deviceAddress, {data, dataSize}, {NULL, 0}, HAL_I3C_DIRECTION_WRITE};

   I3C_XferTypeDef context;
   context.CtrlBuf.pBuffer = controlBuffer;
   context.CtrlBuf.Size = sizeof(controlBuffer);
   context.TxBuf.pBuffer = data;
   context.TxBuf.Size = dataSize;

   HAL_StatusTypeDef status = HAL_I3C_AddDescToFrame(&device->mcu, NULL, &transferDescriptor, &context, 1, I3C_PRIVATE_WITH_ARB_RESTART);

   if (status != HAL_OK) {
      return STATUS_ERROR;
   }

   status = HAL_I3C_Ctrl_Transmit_IT(&device->mcu, &context);

   //    // If we are not in async mode, we need to wait for the transfer to complete
   //    if (!async) {
   //       while (!device->status.masterTransmitComplete)
   //          ;
   //    }

   return status == HAL_OK ? (int)dataSize : STATUS_ERROR;
}

// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
//    👉 I2C master mode memory read/write functions
//    - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// StatusOrNumber microkit_i2c_memory_read(
//     const MicrokitI2cDevice device, const UInt8 deviceAddress,
//     const UInt16 memoryAddress, const UInt16 memoryAddressSize,
//     UInt8* data, const Size dataSize, const Bool async) {

//    ASSERT_NOT_NULL_POINTER(device);
//    ASSERT(device->state == MKIT_DRIVER_STATE_RUNNING);

//    if (HAL_I2C_GetState(&device->mcu) != HAL_I2C_STATE_READY) {
//       return STATUS_ERROR;
//    }

//    if (device->status.memoryReadComplete == false) {
//       return STATUS_ERROR;
//    }

//    HAL_Delay(10); // Without this delay, the transfer is not reliable

//    device->status.memoryReadComplete = false;

//    HAL_StatusTypeDef status = HAL_I2C_Mem_Read_IT(
//        &device->mcu, (UInt16)deviceAddress << 1,
//        memoryAddress,
//        memoryAddressSize,
//        data,
//        dataSize);

//    // If we are not in async mode, we need to wait for the transfer to complete
//    if (!async) {
//       while (!device->status.memoryReadComplete) {
//          // Wait for the transfer to complete
//       };
//    }

//    return status == HAL_OK ? (int)dataSize : STATUS_ERROR;
// }

// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// StatusOrNumber microkit_i2c_memory_write(
//     const MicrokitI2cDevice device, const UInt8 deviceAddress,
//     const UInt16 memoryAddress, const UInt16 memoryAddressSize,
//     const UInt8* data, const Size dataSize, const Bool async) {

//    ASSERT_NOT_NULL_POINTER(device);
//    ASSERT(device->state == MKIT_DRIVER_STATE_RUNNING);

//    if (device->status.memoryWriteComplete == false) {
//       return STATUS_ERROR;
//    }

//    HAL_Delay(10); // Without this delay, the transfer is not reliable

//    device->status.memoryWriteComplete = false;

//    HAL_StatusTypeDef status =
//        HAL_I2C_Mem_Write_IT(
//            &device->mcu,
//            (UInt16)deviceAddress << 1,
//            memoryAddress,
//            memoryAddressSize,
//            (UInt8*)data,
//            dataSize);

//    // If we are not in async mode, we need to wait for the transfer to complete
//    if (!async) {
//       while (!device->status.memoryWriteComplete) {
//          // Wait for the transfer to complete
//       };
//    }

//    return status == HAL_OK ? (int)dataSize : STATUS_ERROR;
// }

/* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
   👉 Vendor specific code
   - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
void HAL_I3C_TgtReqDynamicAddrCallback(I3C_HandleTypeDef* handle, uint64_t targetPayload) {

   // Called when a target responded to a dynamic address request

   MicrokitI3cDevice device = private_get_device_from_handle(handle);

   ASSERT_NOT_NULL_POINTER(device);

   /* Update Payload on aTargetDesc */
   device->targetDescriptors[device->targetCount].targetBcrDcrPid = targetPayload;
   // aTargetDesc[uwTargetCount]->TARGET_BCR_DCR_PID = targetPayload;

   // Send associated dynamic address to target
   HAL_I3C_Ctrl_SetDynAddr(handle, device->targetDescriptors[device->targetCount].dynamicAddress);

   device->targetCount++;
}

/* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
void HAL_I3C_CtrlDAACpltCallback(I3C_HandleTypeDef* handle) {

   // Called when all targets have been assigned a dynamic address

   MicrokitI3cDevice device = private_get_device_from_handle(handle);

   device->busState = MKIT_I3C_BUS_STATE_DYN_ADDR_ASSIGNMENT_FINISHED;
}

// void HAL_I2C_MasterRxCpltCallback(I2C_HandleTypeDef* handle) {

//    // I2C master receive completed

//    MicrokitI2cDevice device = private_get_device_from_handle(handle);

//    ASSERT_NOT_NULL_POINTER(device);

//    if (device->callbacks.masterReceiveCompleteHandler) {
//       device->callbacks.masterReceiveCompleteHandler(device);
//    }

//    device->status.masterReceiveComplete = true;
// }

// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// void HAL_I2C_MasterTxCpltCallback(I2C_HandleTypeDef* handle) {

//    // I2C master transmit completed

//    MicrokitI2cDevice device = private_get_device_from_handle(handle);

//    ASSERT_NOT_NULL_POINTER(device);

//    if (device->callbacks.masterTransmitCompleteHandler) {
//       device->callbacks.masterTransmitCompleteHandler(device);
//    }

//    device->status.masterTransmitComplete = true;
// }

// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// void HAL_I2C_MemRxCpltCallback(I2C_HandleTypeDef* handle) {

//    // I2C memory read completed

