doprause/microkit/lib/targets/stm32/common/i3c.c
//    MicrokitI2cDevice device = private_get_device_from_handle(handle);

//    ASSERT_NOT_NULL_POINTER(device);

//    if (device->callbacks.memoryReadCompleteHandler) {
//       device->callbacks.memoryReadCompleteHandler(device);
//    }

//    device->status.memoryReadComplete = true;
// }

// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// void HAL_I2C_MemTxCpltCallback(I2C_HandleTypeDef* handle) {

//    // I2C memory write completed

//    MicrokitI2cDevice device = private_get_device_from_handle(handle);

//    ASSERT_NOT_NULL_POINTER(device);

//    if (device->callbacks.memoryWriteCompleteHandler) {
//       device->callbacks.memoryWriteCompleteHandler(device);
//    }

//    device->status.memoryWriteComplete = true;
// }

// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// #if MICROKIT_IS_CONFIGURED(CONFIG_I2C_USE_SLAVE_MODE) // 👉 Slave mode code
// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// void HAL_I2C_AddrCallback(I2C_HandleTypeDef* handle, uint8_t TransferDirection,
//                           uint16_t AddrMatchCode) {
//    // DEBUG_PRINT("I2C ADDRESS MATCH\n");

//    // I2C START detected / Transmission has started

//    MicrokitI2cDevice device = private_get_device_from_handle(handle);

//    ASSERT_NOT_NULL_POINTER(device->callbacks.slaveTransmissionStartedHandler);
//    ASSERT_NOT_NULL_POINTER(device->callbacks.slaveTransmissionErrorHandler);

//    if (TransferDirection == I2C_DIRECTION_TRANSMIT) {
//       // DEBUG_PRINT("I2C TX\n");

//       // Master wants to transmit data. So we - the slave - receive it

//       device->callbacks.slaveTransmissionStartedHandler(
//           device, MKIT_I2C_DIRECTION_WRITE, device->status.isRepeatedStart);

//       // I2C_FIRST_FRAME means SLAVE receives the first byte of a sequence.
//       if (HAL_I2C_Slave_Seq_Receive_IT(handle, &device->slave.rxByte, 1,
//                                        I2C_FIRST_FRAME) != HAL_OK) {
//          //     device->callbacks.slaveByteReceivedHandler(device, &byte);
//          // }
//          // else {
//          device->callbacks.slaveTransmissionErrorHandler(device,
//                                                          MKIT_I2C_ERROR);
//       }
//    } else {
//       // DEBUG_PRINT("I2C RX\n");

//       // Master wants to receive data. So we - the slave - transmit it

//       device->callbacks.slaveTransmissionStartedHandler(
//           device, MKIT_I2C_DIRECTION_READ, device->status.isRepeatedStart);

//       device->callbacks.slaveByteRequestedHandler(device,
//                                                   &device->slave.txByte);

//       // I2C_FIRST_FRAME means SLAVE transmits the first byte of a sequence.
//       if (HAL_I2C_Slave_Seq_Transmit_IT(handle, &device->slave.txByte, 1,
//                                         I2C_FIRST_FRAME) != HAL_OK) {
//          device->callbacks.slaveTransmissionErrorHandler(device,
//                                                          MKIT_I2C_ERROR);
//       }
//    }

//    // The isRepeatedStart is set to true on first START condition so it is true
//    // on consecutive START conditions. It will be reset to false on STOP
//    // condition.
//    device->status.isRepeatedStart = true;
// }

// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// void HAL_I2C_SlaveTxCpltCallback(I2C_HandleTypeDef* handle) {
//    // DEBUG_PRINT("I2C SLAVE TX COMPLETE\n");

//    MicrokitI2cDevice device = private_get_device_from_handle(handle);

//    // static uint8 byte = 0x00;
//    device->callbacks.slaveByteRequestedHandler(device, &device->slave.txByte);
//    // DEBUG_PRINT("I2C SLAVE TX COMPLETE > 0x%02x\n", device->slave.txByte);

//    // I2C_NEXT_FRAME means SLAVE is ready to transmit another byte.
//    HAL_I2C_Slave_Seq_Transmit_IT(handle, &device->slave.txByte, 1,
//                                  I2C_NEXT_FRAME);
// }

// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// void HAL_I2C_SlaveRxCpltCallback(I2C_HandleTypeDef* handle) {
//    // DEBUG_PRINT("I2C SLAVE RX COMPLETE\n");

//    MicrokitI2cDevice device = private_get_device_from_handle(handle);

//    // static uint8 byte = 0x00;
//    if (HAL_I2C_Slave_Seq_Receive_IT(handle, &device->slave.rxByte, 1,
//                                     I2C_NEXT_FRAME) == HAL_OK) {
//       device->callbacks.slaveByteReceivedHandler(device, &device->slave.rxByte);
//    } else {
//       device->callbacks.slaveTransmissionErrorHandler(device, MKIT_I2C_ERROR);
//    }

//    // TODO: Check if we need to handle the LAST_FRAME

//    // if (rxcount < RX_BUFFER_SIZE) {
//    // 	if (rxcount == RX_BUFFER_SIZE-1)
//    // 	{
//    // 		HAL_I2C_Slave_Seq_Receive_IT(handle, &byte, 1, I2C_LAST_FRAME);
//    // 	}
//    // 	else
//    // 	{
//    // 		HAL_I2C_Slave_Seq_Receive_IT(handle, &byte, 1, I2C_NEXT_FRAME);
//    // 	}
//    // }

//    // if (rxcount == RX_BUFFER_SIZE)
//    // {
//    // 	// Invoke processing callback
//    // }
// }

// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// void HAL_I2C_ListenCpltCallback(I2C_HandleTypeDef* handle) {
//    // DEBUG_PRINT("I2C LISTEN COMPLETE\n");

//    // I2C STOP detected / Transmission is complete

//    MicrokitI2cDevice device = private_get_device_from_handle(handle);

//    device->callbacks.slaveTransmissionStoppedHandler(device);

//    rearm_i2c_slave_mode(device);
// }

// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// void HAL_I2C_ErrorCallback(I2C_HandleTypeDef* handle) {
//    // DEBUG_PRINT("I2C ERROR\n");

//    MicrokitI2cDevice device = private_get_device_from_handle(handle);

//    // TODO: Implement error statistics

//    UInt32 errorcode = HAL_I2C_GetError(handle);

//    if (errorcode == HAL_I2C_ERROR_BERR) {
//       // BERR error

//       // DEBUG_PRINT("I2C BUS ERROR\n");

//       HAL_I2C_DeInit(handle);
//       HAL_I2C_Init(handle);
//    } else if (errorcode == HAL_I2C_ERROR_AF) {
//       // AF error

//       // DEBUG_PRINT("I2C ACK ERROR\n");

//       // ACK Failure is raised when master sends a STOP before buffer is full.
//       // Instead an error, we treat it as a regular STOP condition.
//       // We don't have to call the slaveTransmissionStoppedHandler(device)
//       // callback because the listen complete handler is called which then calls
//       // the slaveTransmissionStoppedHandler(device) callback
//    } else {
//       Microkit.logger.log(MKIT_LOG_LEVEL_WARN, "UNHANDLED I2C ERROR [%d]", errorcode);
//    }

