doprause/microkit/lib/targets/stm32/common/i3c.c
//    if (device->mode == MKIT_I2C_MODE_MASTER) {
//       if (device->callbacks.masterReceiveCompleteHandler) {
//          device->callbacks.masterReceiveCompleteHandler(device);
//       }

//       if (device->callbacks.masterTransmitCompleteHandler) {
//          device->callbacks.masterTransmitCompleteHandler(device);
//       }

//       if (device->callbacks.memoryReadCompleteHandler) {
//          device->callbacks.memoryReadCompleteHandler(device);
//       }

//       if (device->callbacks.memoryWriteCompleteHandler) {
//          device->callbacks.memoryWriteCompleteHandler(device);
//       }

//       device->status.masterReceiveComplete = true;
//       device->status.masterTransmitComplete = true;
//       device->status.memoryReadComplete = true;
//       device->status.memoryWriteComplete = true;
//    }

//    if (device->mode == MKIT_I2C_MODE_SLAVE) {
//       rearm_i2c_slave_mode(device);
//    }
// }
// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
// #endif // CONFIG_I2C_USE_SLAVE_MODE
// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */

// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
#if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I3C_USE_I3C1)
void I3C1_EV_IRQHandler(void) {
   HAL_I3C_EV_IRQHandler(&DEVICE_I3C1->mcu);
}
#endif

#if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I3C_USE_I3C2)
void I3C2_EV_IRQHandler(void) {
   HAL_I3C_EV_IRQHandler(&DEVICE_I3C2->mcu);
}
#endif

#if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I3C_USE_I3C3)
void I3C3_EV_IRQHandler(void) {
   HAL_I3C_EV_IRQHandler(&DEVICE_I3C3->mcu);
}
#endif

// /* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - */
#if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I3C_USE_I3C1)
void I3C1_ER_IRQHandler(void) {
   HAL_I3C_ER_IRQHandler(&DEVICE_I3C1->mcu);
}
#endif

#if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I3C_USE_I3C2)
void I3C2_ER_IRQHandler(void) {
   HAL_I3C_ER_IRQHandler(&DEVICE_I3C2->mcu);
}
#endif

#if MICROKIT_IS_CONFIGURED(MICROKIT_CONFIG_I3C_USE_I3C3)
void I3C3_ER_IRQHandler(void) {
   HAL_I3C_ER_IRQHandler(&DEVICE_I3C3->mcu);
}
#endif
